backend: "mmdeploy"

input {
  name: "ori_img"
  data_type: TYPE_UINT8
  format: FORMAT_NHWC
  dims: [ -1, -1, 3 ]
  allow_ragged_batch: true
}

output {
  name: "bboxes"
  data_type: TYPE_FP32
  dims: [ -1, 8 ]
}

output {
  name: "scores"
  data_type: TYPE_FP32
  dims: [ -1, 1 ]
}

output {
  name: "rec_texts"
  data_type: TYPE_STRING
  dims: [ -1, 1]
}

output {
  name: "rec_scores"
  data_type: TYPE_STRING
  dims: [ -1, 1 ]
}
