backend: "mmdeploy"

input {
  name: "ori_img"
  data_type: TYPE_UINT8
  format: FORMAT_NHWC
  dims: [ -1, -1, 3 ]
  allow_ragged_batch: true
}

input {
  name: "PoseBbox"
  data_type: TYPE_STRING
  dims: [ 1 ]
  allow_ragged_batch: true
}

output {
  name: "keypoints"
  data_type: TYPE_INT32
  dims: [ -1, -1, 3 ]
}

parameters {
  key: "merge_inputs",
  value: {
    string_value: "0 1"
  }
}
