backend: "mmdeploy"

input {
  name: "ori_img"
  data_type: TYPE_UINT8
  format: FORMAT_NHWC
  dims: [-1, -1, 3]
  allow_ragged_batch: true
}

output {
  name: "mask"
  data_type: TYPE_INT32
  dims: [ -1, -1 ]
}
